In [2]:
import pyodbc

conn = pyodbc.connect('Driver={ODBC Driver 13 for SQL Server};Server=tcp:mssqllearningserver.database.windows.net,1433;Database=sqllearning;Uid=sqladmin;Pwd=SQL@dm!n;Encrypt=yes;TrustServerCertificate=no;Connection Timeout=30;')
cursor = conn.cursor()

In [3]:
sqlStatement = 'SELECT * FROM [emp].[locations]'

cursor.execute(sqlStatement)
for row in cursor.fetchall():
    print(row)

(1400, '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas', 'US')
(1500, '2011 Interiors Blvd', '99236', 'South San Francisco', 'California', 'US')
(1700, '2004 Charade Rd', '98199', 'Seattle', 'Washington', 'US')
(1800, '147 Spadina Ave', 'M5V 2L7', 'Toronto', 'Ontario', 'CA')
(2400, '8204 Arthur St', None, 'London', None, 'UK')
(2500, 'Magdalen Centre, The Oxford Science Park', 'OX9 9ZB', 'Oxford', 'Oxford', 'UK')
(2700, 'Schwanthalerstr. 7031', '80925', 'Munich', 'Bavaria', 'DE')

In [4]:
sqlStatement = 'SELECT * FROM [sales].[staffs]'

cursor.execute(sqlStatement)
for row in cursor.fetchall():
    print(row)

(1, 'Fabiola', 'Jackson', 'fabiola.jackson@bikes.shop', '(831) 555-5554', 1, 1, None)
(2, 'Mireya', 'Copeland', 'mireya.copeland@bikes.shop', '(831) 555-5555', 1, 1, 1)
(3, 'Genna', 'Serrano', 'genna.serrano@bikes.shop', '(831) 555-5556', 1, 1, 2)
(4, 'Virgie', 'Wiggins', 'virgie.wiggins@bikes.shop', '(831) 555-5557', 1, 1, 2)
(5, 'Jannette', 'David', 'jannette.david@bikes.shop', '(516) 379-4444', 1, 2, 1)
(6, 'Marcelene', 'Boyer', 'marcelene.boyer@bikes.shop', '(516) 379-4445', 1, 2, 5)
(7, 'Venita', 'Daniel', 'venita.daniel@bikes.shop', '(516) 379-4446', 1, 2, 5)
(8, 'Kali', 'Vargas', 'kali.vargas@bikes.shop', '(972) 530-5555', 1, 3, 1)
(9, 'Layla', 'Terrell', 'layla.terrell@bikes.shop', '(972) 530-5556', 1, 3, 7)
(10, 'Bernardine', 'Houston', 'bernardine.houston@bikes.shop', '(972) 530-5557', 1, 3, 7)

In [5]:
sqlStatement = '''SELECT r.region_name,
c.country_name
FROM [emp].[regions] as r
INNER JOIN [emp].[countries] as c ON r.region_id = c.region_id
ORDER BY r.region_name'''

cursor.execute(sqlStatement)
for row in cursor.fetchall():
    print(row)

('Americas', 'Argentina')
('Americas', 'Brazil')
('Americas', 'Canada')
('Americas', 'Mexico')
('Americas', 'United States of America')
('Asia', 'Australia')
('Asia', 'China')
('Asia', 'HongKong')
('Asia', 'India')
('Asia', 'Japan')
('Asia', 'Singapore')
('Europe', 'Belgium')
('Europe', 'Switzerland')
('Europe', 'Germany')
('Europe', 'Denmark')
('Europe', 'France')
('Europe', 'Italy')
('Europe', 'Netherlands')
('Europe', 'United Kingdom')
('Middle East and Africa', 'Egypt')
('Middle East and Africa', 'Israel')
('Middle East and Africa', 'Kuwait')
('Middle East and Africa', 'Nigeria')
('Middle East and Africa', 'Zambia')
('Middle East and Africa', 'Zimbabwe')

In [12]:
sqlStatement = 'SELECT * FROM [emp].[regions]'

cursor.execute(sqlStatement)
for row in cursor.fetchall():
    print(row)

(1, 'Europe')
(2, 'Americas')
(3, 'Asia - Pacific')
(4, 'Middle East and Africa')

In [7]:

sqlStatement = "INSERT INTO [emp].[regions] VALUES ('Pacific')"
cursor.execute(sqlStatement)
conn.commit()

In [9]:

sqlStatement = "DELETE FROM [emp].[regions] WHERE region_name = 'Pacific'"
cursor.execute(sqlStatement)
conn.commit()

In [11]:

sqlStatement = "UPDATE r SET r.region_name = 'Asia - Pacific' FROM [emp].[regions] as r WHERE r.region_name = 'Asia'"
cursor.execute(sqlStatement)
conn.commit()